# i = 1
# while i<20:
#     print('hello')
#     i=i+2

# i=20
# while i<=30:
#     print(i)
#     i=i+2

# guess = input()
# password = "qwerty"
# count = 0
# while guess != password:
#     count += 1
#     print('Error')
#     guess = input()
# print("You made", count, "www")

# a = [1, 2, 3, 4, 5] * 4
# print(a)
# # a.remove(3)
# # print(a)
# while 3 in a:
#     a.remove(3)
# print(a)

# Вывести на экран все числа от 50 до 150 включительно с помощью цикла while.
# i = 50
# while i<=150:
#     print(i)
#     i = i + 50

# Вывести на экран при помощи цикла while следующий ряд чисел: 13, 20, 27 ...., 349.

# i = 13
# while i<=349:
#     print(i)
#     i = i + 7

# Напишите программу, которая при помощи цикла while сделает обратный отсчет от 15 до 0 (включительно) и
# затем выведет "Поехали!" в самом конце.

# i = 15
# while i>=0:
#     print(i)
#     i = i - 1
# print('go')
